In [2]:
import pandas as pd
empdata = pd.read_csv('../../kids.csv', index_col=False, delimiter = ',', header=None)
empdata.head()

,0,1,2,3,4,5
0,Theodora,Stückler,2010-09-12,Luttenbergerweg 0/8. 1991 Althofen,Austria,6.216544
1,Inga,Poulsen,2015-03-11,"3441 Nørgaard Branch. Palleborough, LA 62197",Denmark,8.668031
2,Luka,Kunz,2017-07-14,Bodnerstraße 4/9. 6178 Mannersdorf am Leithage...,Austria,10.000000
3,Ιερεμίας,Παπασπηλιωτοπούλου,2019-06-13,"Δημητρητσίου 920,. ΤΚ 20530 Σέρρες",Greece,10.000000
4,Carla,Pudjiastuti,2018-07-20,"Jalan Stasiun Wonokromo No. 146. Magelang, LA ...",Indonesia,7.339111

In [17]:
import mysql.connector as msql
from mysql.connector import Error
try:
    conn = msql.connect(host='localhost', user='sa', password='miContrasena123')
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("CREATE DATABASE kid")
        print("Database is created")
except Error as e:
    print("Error while connecting to MySQL", e)

Error while connecting to MySQL 2003: Can't connect to MySQL server on 'localhost:3306' (61 Connection refused)